holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.radial_panel = lv_obj_create(result.panel);

    // Hide & disable scrollbar
    lv_obj_set_scrollbar_mode(result.radial_panel, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.radial_panel, LV_DIR_NONE);

    // Size and position
    lv_obj_set_size(result.radial_panel, radial_size_w, radial_size_h);
    lv_obj_align(result.radial_panel, alignment, pos_x, pos_y);

    // Main style: radius
    lv_obj_set_style_radius(result.radial_panel, 360, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.radial_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.radial_panel, lv_color_make(0, 255, 0), LV_PART_MAIN);
    
    // Main style: border
    lv_obj_set_style_border_width(result.radial_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.radial_panel, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_opa(result.radial_panel, LV_OPA_0, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.radial_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.radial_panel, default_shadow_hue, LV_PART_MAIN);

    // Remove padding
    lv_obj_set_style_pad_all(result.radial_panel, 0, LV_PART_MAIN);

    // #############################################################################################
    // DEGREE TICK MARKS
    // #############################################################################################

    /* Draw degree markers around the inside of the radial panel */

    int32_t tick_radius = radial_size_w / 2;
    int32_t tick_center_x = tick_radius;
    int32_t tick_center_y = tick_radius;
    
    // Major tick length (every 30 degrees - cardinal directions)
    int32_t major_tick_length = 15;
    // Minor tick length (every 5 degrees)
    int32_t minor_tick_length = 8;
    
    lv_color_t tick_color = lv_color_make(0, 255, 0); // Green
    
    // Draw degree marks
    for (int degree = 0; degree < 360; degree += 5) {
        vTaskDelay(pdMS_TO_TICKS(1));
        // Convert degree to radians (0° is at top, increases clockwise)
        float angle_rad = (degree - 90) * M_PI / 180.0f;  // -90 to start from top
        
        // Determine if this is a major tick (0, 90, 180, 270)
        bool is_major = (degree % 30 == 0);
        int32_t tick_length = is_major ? major_tick_length : minor_tick_length;
        
        // Inner and outer radii for tick marks
        int32_t outer_r = tick_radius - 3;  // Start near the outline
        int32_t inner_r = outer_r - tick_length;
        
        // Calculate outer point (near edge)
        int32_t outer_x = tick_center_x + (int32_t)(outer_r * cosf(angle_rad));
        int32_t outer_y = tick_center_y + (int32_t)(outer_r * sinf(angle_rad));
        
        // Calculate inner point
        int32_t inner_x = tick_center_x + (int32_t)(inner_r * cosf(angle_rad));
        int32_t inner_y = tick_center_y + (int32_t)(inner_r * sinf(angle_rad));
        
        // Draw tick line - allocate points array for each line
        lv_point_precise_t *tick_points = (lv_point_precise_t *)malloc(2 * sizeof(lv_point_precise_t));
        tick_points[0].x = outer_x;
        tick_points[0].y = outer_y;
        tick_points[1].x = inner_x;
        tick_points[1].y = inner_y;
        
        lv_obj_t *tick = lv_line_create(result.radial_panel);
        lv_line_set_points(tick, tick_points, 2);
        lv_obj_set_style_line_width(tick, is_major ? 2 : 1, LV_PART_MAIN);
        lv_obj_set_style_line_color(tick, tick_color, LV_PART_MAIN);
    }

    // #############################################################################################
    // ROLL PANEL
    // #############################################################################################

    /* Roll Line rotates inside and independently of radial panel */

    // Roll Panel
    int32_t roll_size_w = (size_w_px / 32)*10;
    int32_t roll_size_h = (size_w_px / 32)*2;

    result.roll_panel = lv_obj_create(result.panel);

    // Hide & disable scrollbar
    lv_obj_set_scrollbar_mode(result.roll_panel, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.roll_panel, LV_DIR_NONE);

    // Size and position
    lv_obj_set_size(result.roll_panel, roll_size_w, roll_size_h);
    lv_obj_align(result.roll_panel, alignment, pos_x, pos_y);

    // Main style: radius
    lv_obj_set_style_radius(result.roll_panel, 0, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.roll_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.roll_panel, default_outline_hue, LV_PART_MAIN);
    
    // Main style: border
    lv_obj_set_style_border_width(result.roll_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.roll_panel, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_opa(result.roll_panel, LV_OPA_0, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.roll_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.roll_panel, default_shadow_hue, LV_PART_MAIN);

    // Remove padding
    lv_obj_set_style_pad_all(result.roll_panel, 0, LV_PART_MAIN);

    // Set pivot
    lv_obj_set_style_transform_pivot_x(result.roll_panel, lv_pct(50), LV_PART_MAIN);
    lv_obj_set_style_transform_pivot_y(result.roll_panel, lv_pct(50), LV_PART_MAIN);

    int32_t roll_line_length = (size_w_px / 32)*1;
    int32_t roll_line_width = 2;
    int32_t roll_center_x = roll_size_w / 2;
    int32_t roll_center_y = roll_size_h / 2;
    lv_color_t roll_line_color = lv_color_make(0, 255, 0);

    // Left roll line
    {
        static lv_point_precise_t left_line[2];
        left_line[0].x = 0;
        left_line[0].y = 0;
        left_line[1].x = roll_line_length;
        left_line[1].y = 0;
        lv_obj_t *left_roll_line = lv_line_create(result.roll_panel);
        lv_line_set_points(left_roll_line, left_line, 2);
        lv_obj_set_style_line_width(left_roll_line, roll_line_width, LV_PART_MAIN);
        lv_obj_set_style_line_color(left_roll_line, roll_line_color, LV_PART_MAIN);
        lv_obj_set_pos(left_roll_line, 0, roll_center_y);
    }

    // Right roll line
    {
        static lv_point_precise_t right_line[2];
        right_line[0].x = 0;
        right_line[0].y = 0;
        right_line[1].x = roll_line_length;
        right_line[1].y = 0;
        lv_obj_t *right_roll_line = lv_line_create(result.roll_panel);
        lv_line_set_points(right_roll_line, right_line, 2);
        lv_obj_set_style_line_width(right_roll_line, roll_line_width, LV_PART_MAIN);
        lv_obj_set_style_line_color(right_roll_line, roll_line_color, LV_PART_MAIN);
        lv_obj_set_pos(right_roll_line, roll_size_w - roll_line_length, roll_center_y);
    }

    // Center rectangle
    {
        int32_t rect_width = (size_w_px / 32)*1;
        int32_t rect_height = (size_w_px / 32)*1;
        lv_obj_t *center_rect = lv_obj_create(result.roll_panel);

        // Hide & disable scrollbar
        lv_obj_set_scrollbar_mode(center_rect, LV_SCROLLBAR_MODE_OFF);
        lv_obj_set_scroll_dir(center_rect, LV_DIR_NONE);

        // Size and position
        lv_obj_set_size(center_rect, rect_width, rect_height);
        lv_obj_align(center_rect, alignment, pos_x, pos_y);

