holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Store total width for scrolling calculations
    lv_obj_update_layout(pitch_label);
    result.pitch_tape_content_height_px = lv_obj_get_height(pitch_label);

    // ---------------------------------------------------------
    // Create center marker: right-pointing triangle beside pitch tape
    // ---------------------------------------------------------
    result.pitch_center_marker_0 = lv_obj_create(result.pitch_panel);
    lv_obj_set_scrollbar_mode(result.pitch_center_marker_0, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.pitch_center_marker_0, LV_DIR_NONE);
    lv_obj_set_size(result.pitch_center_marker_0, 6, 6);
    lv_obj_align(result.pitch_center_marker_0, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_style_radius(result.pitch_center_marker_0, 0, LV_PART_MAIN);
    lv_obj_set_style_border_width(result.pitch_center_marker_0, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_color(result.pitch_center_marker_0, lv_color_make(0, 255, 0), LV_PART_MAIN);
    lv_obj_set_style_outline_width(result.pitch_center_marker_0, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_width(result.pitch_center_marker_0, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(result.pitch_center_marker_0, 0, LV_PART_MAIN);
    lv_obj_clear_flag(result.pitch_center_marker_0, LV_OBJ_FLAG_SCROLLABLE);

    result.pitch_center_marker_1 = lv_obj_create(result.pitch_panel);
    lv_obj_set_scrollbar_mode(result.pitch_center_marker_1, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.pitch_center_marker_1, LV_DIR_NONE);
    lv_obj_set_size(result.pitch_center_marker_1, 6, 6);
    lv_obj_align(result.pitch_center_marker_1, LV_ALIGN_RIGHT_MID, 0, 0);
    lv_obj_set_style_radius(result.pitch_center_marker_1, 0, LV_PART_MAIN);
    lv_obj_set_style_border_width(result.pitch_center_marker_1, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_color(result.pitch_center_marker_1, lv_color_make(0, 255, 0), LV_PART_MAIN);
    lv_obj_set_style_outline_width(result.pitch_center_marker_1, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_width(result.pitch_center_marker_1, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(result.pitch_center_marker_1, 0, LV_PART_MAIN);
    lv_obj_clear_flag(result.pitch_center_marker_1, LV_OBJ_FLAG_SCROLLABLE);

    // #############################################################################################
    // HEADING TAPE
    // #############################################################################################
    
    result.gh_tape_width_px = (size_h_px / 32)*12;
    int32_t tape_height_px = (size_h_px / 32)*3;

    // ---------------------------------------------------------
    // Create panel
    // ---------------------------------------------------------
    result.gh_panel = lv_obj_create(result.panel);

    // Container scrolling enabled horizontally
    lv_obj_set_scrollbar_mode(result.gh_panel, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.gh_panel, LV_DIR_NONE);
    
    // Size and position
    lv_obj_set_size(result.gh_panel, result.gh_tape_width_px+18, tape_height_px);
    lv_obj_align(result.gh_panel, LV_ALIGN_TOP_MID, 0, outline_width);

    // Main style: radius
    lv_obj_set_style_radius(result.gh_panel, 0, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.gh_panel, 1, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.gh_panel, lv_color_make(0, 255, 0), LV_PART_MAIN);
    
    // Main style: border
    lv_obj_set_style_border_width(result.gh_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.gh_panel, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_opa(result.gh_panel, LV_OPA_0, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.gh_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.gh_panel, default_shadow_hue, LV_PART_MAIN);

    // Remove padding
    lv_obj_set_style_pad_all(result.gh_panel, 0, LV_PART_MAIN);
    
    // ---------------------------------------------------------
    // Create tape
    // ---------------------------------------------------------
    result.gh_tape = lv_obj_create(result.gh_panel);

    // Container scrolling enabled horizontally
    lv_obj_set_scrollbar_mode(result.gh_tape, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.gh_tape, LV_DIR_HOR);
    
    // Size and position
    lv_obj_set_size(result.gh_tape, result.gh_tape_width_px, tape_height_px);
    lv_obj_align(result.gh_tape, LV_ALIGN_CENTER, 0, 0);

    // Main style: radius
    lv_obj_set_style_radius(result.gh_tape, 0, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.gh_tape, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.gh_tape, lv_color_make(0, 255, 0), LV_PART_MAIN);
    
    // Main style: border
    lv_obj_set_style_border_width(result.gh_tape, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.gh_tape, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_opa(result.gh_tape, LV_OPA_0, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.gh_tape, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.gh_tape, default_shadow_hue, LV_PART_MAIN);

    // Remove padding
    lv_obj_set_style_pad_all(result.gh_tape, 0, LV_PART_MAIN);

    // ---------------------------------------------------------
    // Label the tape
    // ---------------------------------------------------------
    lv_obj_t *gh_label = lv_label_create(result.gh_tape);

    // Label must not scroll independently
    lv_obj_set_scrollbar_mode(gh_label, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(gh_label, LV_DIR_NONE);
    lv_obj_clear_flag(gh_label, LV_OBJ_FLAG_SCROLLABLE);

    // Vertical centering: calculate Y position to center the text (monospace is required for this object)
    int32_t font_line_height = lv_font_get_line_height(&Mono_Bold_14) * 1;
    int32_t center_y = (tape_height_px - font_line_height) / 2;

    // Size label to content width not container width
    lv_obj_set_size(gh_label, LV_SIZE_CONTENT, tape_height_px);
    lv_obj_set_pos(gh_label, 0, center_y);

