holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Main style: radius
    lv_obj_set_style_radius(gh_label, 0, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(gh_label, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(gh_label, lv_color_make(0, 255, 0), LV_PART_MAIN);
    
    // Main style: border
    lv_obj_set_style_border_width(gh_label, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(gh_label, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_opa(gh_label, LV_OPA_0, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(gh_label, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(gh_label, default_shadow_hue, LV_PART_MAIN);

    // Remove padding
    lv_obj_set_style_pad_all(gh_label, 0, LV_PART_MAIN);

    // Main style: text
    static char gh_tape_text[1080 * 6 + 1] = {0};
    // Only populate the tape text buffer on first run
    if (gh_tape_text[0] == '\0') {
        for (int rep = 0; rep < 3; rep++) {
            vTaskDelay(pdMS_TO_TICKS(1));
            for (int i = 0; i < 360; i++) {
                char tmp[8];
                snprintf(tmp, sizeof(tmp), "%03d  ", i);
                strcat(gh_tape_text, tmp);
            }
        }
    }
    lv_obj_set_style_text_font(gh_label, &Mono_Bold_14, LV_PART_MAIN);
    lv_obj_set_style_text_color(gh_label, lv_color_make(0, 255, 0), LV_PART_MAIN);
    lv_label_set_text(gh_label, gh_tape_text);

    // Store total width for scrolling calculations
    lv_obj_update_layout(gh_label);
    result.gh_tape_content_width_px = lv_obj_get_width(gh_label);

    // ---------------------------------------------------------
    // Create center marker: downward-pointing triangle below gh tape
    // ---------------------------------------------------------
    result.gh_center_marker_0 = lv_obj_create(result.gh_panel);
    lv_obj_set_scrollbar_mode(result.gh_center_marker_0, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.gh_center_marker_0, LV_DIR_NONE);
    lv_obj_set_size(result.gh_center_marker_0, 6, 6);
    lv_obj_align(result.gh_center_marker_0, LV_ALIGN_TOP_MID, 0, 0);
    lv_obj_set_style_radius(result.gh_center_marker_0, 0, LV_PART_MAIN);
    lv_obj_set_style_border_width(result.gh_center_marker_0, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_color(result.gh_center_marker_0, lv_color_make(0, 255, 0), LV_PART_MAIN);
    lv_obj_set_style_outline_width(result.gh_center_marker_0, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_width(result.gh_center_marker_0, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(result.gh_center_marker_0, 0, LV_PART_MAIN);
    lv_obj_clear_flag(result.gh_center_marker_0, LV_OBJ_FLAG_SCROLLABLE);

    result.gh_center_marker_1 = lv_obj_create(result.gh_panel);
    lv_obj_set_scrollbar_mode(result.gh_center_marker_1, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.gh_center_marker_1, LV_DIR_NONE);
    lv_obj_set_size(result.gh_center_marker_1, 6, 6);
    lv_obj_align(result.gh_center_marker_1, LV_ALIGN_BOTTOM_MID, 0, 0);
    lv_obj_set_style_radius(result.gh_center_marker_1, 0, LV_PART_MAIN);
    lv_obj_set_style_border_width(result.gh_center_marker_1, 0, LV_PART_MAIN);
    lv_obj_set_style_bg_color(result.gh_center_marker_1, lv_color_make(0, 255, 0), LV_PART_MAIN);
    lv_obj_set_style_outline_width(result.gh_center_marker_1, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_width(result.gh_center_marker_1, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(result.gh_center_marker_1, 0, LV_PART_MAIN);
    lv_obj_clear_flag(result.gh_center_marker_1, LV_OBJ_FLAG_SCROLLABLE);

    // todo: write actual values to display, roll, pitch, yaw, gforce xyz, speed, altitude, etc.
    // todo: special labels/slots that can be connected to matrix switches to convey true/false, enable/disable, etc.
    // monospace font between 8 and 16 px: 8 too small, 16 too big.

    // #############################################################################################
    // COORD
    // #############################################################################################

    result.latitude_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_LEFT, // parent alignment
        0,                    // pos x
        -20,                  // pos y
        "LAT ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    result.longitude_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_LEFT, // parent alignment
        0,                    // pos x
        0,                    // pos y
        "LON ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    result.speed_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_MID,  // parent alignment
        0,                    // pos x
        0,                  // pos y
        "SPD ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

