holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Always create a fresh screen
    gyro_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    lv_scr_load_anim(gyro_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(gyro_screen);

    lv_obj_invalidate(gyro_screen);  // Force redraw
    lv_timer_handler();  // Process events/render

    // Gyro
    gyro_0_c = create_gyro_panel(
        gyro_screen,      // parent
        650,              // width px
        (general_menu_row_h_px*5)-(outline_width*2)-(2*2), // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        0,                // pos y
        radius_rounded,   // radius
        2,                // outer_pad_all
        4,                // inner_pad_all
        2,                // outline_padding
        2,                // main_row_padding
        4,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        general_menu_row_h_px, // row height
        true,             // show scrollbar
        true,             // enable scrolling
        &cobalt_alien_25, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    // Calibrate Gyro -> Button starts timer -> calibration ends on timeout.

    // Calibrate Magnetic Field -> Button starts timer -> calibration ends on timeout.

    lv_obj_invalidate(gyro_screen);  // Force redraw
    lv_timer_handler();  // Process events/render
}

/** -------------------------------------------------------------------------------------
 * @brief Show System Settings Screen.
 */
void display_mplex0_screen()
{
    // Set Display Flag
    flag_display_mplex0_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == mplex0_screen) {
        return;
    }

    current_screen_number = MPLEX0_SCREEN;

    // Always create a fresh screen
    mplex0_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    lv_scr_load_anim(mplex0_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(mplex0_screen);

    lv_obj_invalidate(mplex0_screen);  // Force redraw
    lv_timer_handler();  // Process events/render

    // Admplex 0
    admlpex0_c = create_admplex0_panel(
        mplex0_screen,     // parent
        general_menu_w_px, // width px
        general_menu_h_px, // height px
        LV_ALIGN_CENTER,   // alignment
        0,                 // pos x
        0,                 // pos y
        radius_rounded,    // radius
        2,                 // outer_pad_all
        4,                 // inner_pad_all
        2,                 // outline_padding
        2,                 // main_row_padding
        4,                 // main_column_padding
        2,                 // sub_row_padding
        8,                 // sub_column_padding
        general_menu_row_h_px, // row height
        true,              // show scrollbar
        true,              // enable scrolling
        &cobalt_alien_25,  // font for titles,
        &cobalt_alien_17   // font for text,
    );

    lv_obj_invalidate(mplex0_screen);  // Force redraw
    lv_timer_handler();  // Process events/render
}

/** -------------------------------------------------------------------------------------
 * @brief Show Serial Screen.
 */
void display_serial_screen()
{
    // Set Display Flag
    flag_display_serial_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == serial_screen) {
        return;
    }

    current_screen_number = SERIAL_SCREEN;

    // Always create a fresh screen
    serial_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    lv_scr_load_anim(serial_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(serial_screen);

    lv_obj_invalidate(serial_screen);  // Force redraw
    lv_timer_handler();  // Process events/render

    // Serial
    serial_c = create_serial_panel(
        serial_screen,     // parent
        general_menu_w_px, // width px
        general_menu_h_px, // height px
        LV_ALIGN_CENTER,   // alignment
        0,                 // pos x
        0,                 // pos y
        radius_rounded,    // radius
        2,                 // outer_pad_all
        4,                 // inner_pad_all
        2,                 // outline_padding
        2,                 // main_row_padding
        4,                 // main_column_padding
        2,                 // sub_row_padding
        8,                 // sub_column_padding
        general_menu_row_h_px, // row height
        true,              // show scrollbar
        true,              // enable scrolling
        &cobalt_alien_25,  // font for titles,
        &cobalt_alien_17   // font for text,
    );

    lv_obj_invalidate(serial_screen);  // Force redraw
    lv_timer_handler();  // Process events/render
}

/** -------------------------------------------------------------------------------------
 * @brief Show UAP Screen.
 */
void display_uap_screen()
{
    // Set Display Flag
    flag_display_uap_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == uap_screen) {
        return;
    }

    current_screen_number = UAP_SCREEN;

    // Always create a fresh screen
    uap_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    lv_scr_load_anim(uap_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(uap_screen);

    lv_obj_invalidate(uap_screen);  // Force redraw
    lv_timer_handler();  // Process events/render

    // create UAP
    uap_c = create_uap(
        uap_screen,
        500,
        500,
        LV_ALIGN_CENTER,
        0,
        0,
        general_radius
    );

    lv_obj_invalidate(serial_screen);  // Force redraw
    lv_timer_handler();  // Process events/render
}

/** -------------------------------------------------------------------------------------
 * @brief Timer runs update_display function.
 */

int64_t ui_timing_second   = 0;
bool ui_timing_second_flag = false;

