holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                        /* Switch Intention (blue text) */
                        if (matrixData.switch_intention[0][i]==true) {lv_obj_set_style_text_color(label, lv_color_make(0, 0, 255), LV_PART_MAIN);}
                        else {
                            /* Computer Intention (yellow text) */
                            if (matrixData.computer_intention[0][i]==true) {lv_obj_set_style_text_color(label, lv_color_make(255, 255, 0), LV_PART_MAIN);}
                            else {lv_obj_set_style_text_color(label, lv_color_make(58, 58, 58), LV_PART_MAIN);}
                        }
                    }
                }
            }
        }

        // Matrix Configuration Panel
        else if (current_matrix_panel_view==MATRIX_SWITCH_PANEL_NUMBER_MATRIX) {

            // Switch Panel
            lv_obj_set_style_text_color(matrix_switch_panel.switch_overview_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
            lv_obj_set_style_bg_color(matrix_switch_panel.switch_overview_panel.panel, default_btn_off_bg, LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_switch_panel.switch_matrix_panel.label, rainbow_contrast_value_hue, LV_PART_MAIN);
            lv_obj_set_style_bg_color(matrix_switch_panel.switch_matrix_panel.panel, default_btn_on_bg, LV_PART_MAIN);
            lv_obj_set_style_text_color(matrix_switch_panel.switch_mapping_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
            lv_obj_set_style_bg_color(matrix_switch_panel.switch_mapping_panel.panel, default_btn_off_bg, LV_PART_MAIN);

            if (mfc.panel) {
                lv_obj_set_flag(matrix_overview_grid_1, LV_OBJ_FLAG_HIDDEN, true);
                lv_obj_set_flag(mfc.panel, LV_OBJ_FLAG_HIDDEN, false);
                lv_obj_set_flag(mcc.panel, LV_OBJ_FLAG_HIDDEN, true);

                // Current Switch
                lv_dropdown_set_selected(mfc.dd_switch_index_select, current_matrix_i);

                // Current Function
                lv_dropdown_set_selected(mfc.dd_function_index_select, current_matrix_function_i);

                // Value Primary Function Comparotor
                lv_dropdown_set_selected(mfc.dd_function_name, matrixData.matrix_function[0][current_matrix_i][current_matrix_function_i]);

                // X Comparitor Mode
                lv_dropdown_set_selected(mfc.dd_mode_x, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]);
                // X Value
                if (matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]==0) {
                    // Mode 0: User Defined
                    lv_label_set_text(mfc.val_x, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]).c_str());
                    lv_obj_set_flag(mfc.dd_x, LV_OBJ_FLAG_HIDDEN, true);
                    lv_obj_set_flag(mfc.val_x, LV_OBJ_FLAG_HIDDEN, false);
                }
                else {
                    // Mode 1: System Defined
                    lv_dropdown_set_selected(mfc.dd_x, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_X]);
                    lv_obj_set_flag(mfc.val_x, LV_OBJ_FLAG_HIDDEN, true);
                    lv_obj_set_flag(mfc.dd_x, LV_OBJ_FLAG_HIDDEN, false);
                }

                // Y Comparitor Mode
                lv_dropdown_set_selected(mfc.dd_mode_y, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]);
                // Y Value
                if (matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]==0) {
                    // Mode 0: User Defined
                    lv_label_set_text(mfc.val_y, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]).c_str());
                    lv_obj_set_flag(mfc.dd_y, LV_OBJ_FLAG_HIDDEN, true);
                    lv_obj_set_flag(mfc.val_y, LV_OBJ_FLAG_HIDDEN, false);
                }
                else {
                    // Mode 1: System Defined
                    lv_dropdown_set_selected(mfc.dd_y, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Y]);
                    lv_obj_set_flag(mfc.val_y, LV_OBJ_FLAG_HIDDEN, true);
                    lv_obj_set_flag(mfc.dd_y, LV_OBJ_FLAG_HIDDEN, false);
                }

                // Z Comparitor Mode
                lv_dropdown_set_selected(mfc.dd_mode_z, matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]);
                // Z Value
                if (matrixData.matrix_function_mode_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]==0) {
                    // Mode 0: User Defined
                    lv_label_set_text(mfc.val_z, String(matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]).c_str());
                    lv_obj_set_flag(mfc.dd_z, LV_OBJ_FLAG_HIDDEN, true);
                    lv_obj_set_flag(mfc.val_z, LV_OBJ_FLAG_HIDDEN, false);
                }
                else {
                    // Mode 1: System Defined
                    lv_dropdown_set_selected(mfc.dd_z, matrixData.matrix_function_xyz[0][current_matrix_i][current_matrix_function_i][INDEX_MATRIX_FUNTION_Z]);
                    lv_obj_set_flag(mfc.val_z, LV_OBJ_FLAG_HIDDEN, true);
                    lv_obj_set_flag(mfc.dd_z, LV_OBJ_FLAG_HIDDEN, false);
                }

                // Operator
                lv_dropdown_set_selected(mfc.dd_operator, matrixData.matrix_switch_operator_index[0][current_matrix_i][current_matrix_function_i]);

                // Inverted
                lv_dropdown_set_selected(mfc.dd_inverted_logic, matrixData.matrix_switch_inverted_logic[0][current_matrix_i][current_matrix_function_i]);

